In [40]:
import pandas as pd

In [53]:
ordered_satisfaction = ['Very Unhappy', 'Unhappy', 'Neutral', 'Happy', 'Very Happy']

In [54]:
df = pd.DataFrame({'satisfaction':['Mad', 'Happy', 'Unhappy', 'Neutral','Very Happy','Very Unhappy']})

In [55]:
df.dtypes

satisfaction    object
dtype: object

In [56]:
from pandas.api.types import CategoricalDtype
dtype = CategoricalDtype(
    categories=ordered_satisfaction, ordered=True)
df.satisfaction = df.satisfaction.astype(dtype).cat.codes

In [38]:
#df.satisfaction = df.satisfaction.astype(dtype)

In [57]:
df

   satisfaction
0            -1
1             3
2             1
3             2
4             4
5             0

In [64]:
df = pd.DataFrame({'vertebrates':['Bird',
  'Bird',
 'Mammal',
  'Fish',
  'Amphibian',
 'Reptile',
 'Mammal',
]})

In [65]:
df

  vertebrates
0        Bird
1        Bird
2      Mammal
3        Fish
4   Amphibian
5     Reptile
6      Mammal

In [66]:
df['vertebrates'] = df.vertebrates.astype("category").cat.codes

In [67]:
df

   vertebrates
0            1
1            1
2            3
3            2
4            0
5            4
6            3

In [62]:
df = pd.get_dummies(df,columns=['vertebrates'])

In [69]:
df

   A   B     C     D
0  3   2  14.0  14.0
1  +   3   3.0   3.0
2  5  54   NaN   NaN
3  3   3   3.0   3.0
4  1   1   NaN   NaN

In [109]:
df = pd.DataFrame({"A":[None, '+', 5, 3, 1], 
                   "B":[2, 3, 54, 3, 1], 
                   "C":[3, None, None, 3, None], 
                   "D":[14, 3, None, 3, None]})

In [77]:
df.describe()

               B          C          D
count   5.000000   3.000000   3.000000
mean   12.600000   6.666667   6.666667
std    23.158152   6.350853   6.350853
min     1.000000   3.000000   3.000000
25%     2.000000   3.000000   3.000000
50%     3.000000   3.000000   3.000000
75%     3.000000   8.500000   8.500000
max    54.000000  14.000000  14.000000

In [98]:
df

   A   B    C     D
0  3   2  3.0  14.0
1  +   3  NaN   3.0
2  5  54  NaN   NaN
3  3   3  3.0   3.0
4  1   1  NaN   NaN

In [95]:
df.interpolate(method ='linear', limit_direction ='backward')

   A   B    C     D
0  3   2  3.0  14.0
1  +   3  3.0   3.0
2  5  54  3.0   3.0
3  3   3  3.0   3.0
4  1   1  NaN   NaN

In [ ]:
df2 = df.interpolate(method ='linear', limit_direction ='forward')

In [ ]:
df3 = df2.interpolate(method ='linear', limit_direction ='backward')

In [105]:
help(df.dropna)

Help on method dropna in module pandas.core.frame:

dropna(axis=0, how='any', thresh=None, subset=None, inplace=False) method of pandas.core.frame.DataFrame instance
    Remove missing values.

    See the :ref:`User Guide <missing_data>` for more on which values are
    considered missing, and how to work with missing data.

    Parameters
    ----------
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Determine if rows or columns which contain missing values are
        removed.

        * 0, or 'index' : Drop rows which contain missing values.
        * 1, or 'columns' : Drop columns which contain missing value.

        .. versionchanged:: 1.0.0

           Pass tuple or list to drop on multiple axes.
           Only a single axis is allowed.

    how : {'any', 'all'}, default 'any'
        Determine if row or column is removed from DataFrame, when we have
        at least one NA or all NA.

        * 'any' : If any NA values are present, drop that row or column.
        * 'all' : If all values are NA, drop that row or column.

    thresh : int, optional
        Require that many non-NA values.
    subset : array-like, optional
        Labels along other axis to consider, e.g. if you are dropping rows
        these would be a list of columns to include.
    inplace : bool, default False
        If True, do operation inplace and return None.

    Returns
    -------
    DataFrame
        DataFrame with NA entries dropped from it.

    See Also
    --------
    DataFrame.isna: Indicate missing values.
    DataFrame.notna : Indicate existing (non-missing) values.
    DataFrame.fillna : Replace missing values.
    Series.dropna : Drop missing values.
    Index.dropna : Drop missing indices.

    Examples
    --------
    >>> df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
    ...                    "toy": [np.nan, 'Batmobile', 'Bullwhip'],
    ...                    "born": [pd.NaT, pd.Timestamp("1940-04-25"),
    ...                             pd.NaT]})
    >>> df
           name        toy       born
    0    Alfred        NaN        NaT
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Drop the rows where at least one element is missing.

    >>> df.dropna()
         name        toy       born
    1  Batman  Batmobile 1940-04-25

    Drop the columns where at least one element is missing.

    >>> df.dropna(axis='columns')
           name
    0    Alfred
    1    Batman
    2  Catwoman

    Drop the rows where all elements are missing.

    >>> df.dropna(how='all')
           name        toy       born
    0    Alfred        NaN        NaT
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Keep only the rows with at least 2 non-NA values.

    >>> df.dropna(thresh=2)
           name        toy       born
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Define in which columns to look for missing values.

    >>> df.dropna(subset=['name', 'born'])
           name        toy       born
    1    Batman  Batmobile 1940-04-25

    Keep the DataFrame with valid entries in the same variable.

    >>> df.dropna(inplace=True)
    >>> df
         name        toy       born
    1  Batman  Batmobile 1940-04-25

In [110]:
df

      A   B    C     D
0  None   2  3.0  14.0
1     +   3  NaN   3.0
2     5  54  NaN   NaN
3     3   3  3.0   3.0
4     1   1  NaN   NaN

In [111]:
df.dropna(axis=1, thresh=3)

      A   B     D
0  None   2  14.0
1     +   3   3.0
2     5  54   NaN
3     3   3   3.0
4     1   1   NaN

In [ ]:
df.B.unique()

array([ 2,  3, 54,  1], dtype=int64)

In [ ]:
df.drop_duplicates().reset_index(inplace=True )

In [ ]:
df..value_counts()

3.0     2
14.0    1
Name: D, dtype: int64

In [ ]:
df = df3.reset_index()

In [ ]:
df

   index  A   B     C     D
0      0  3   2  14.0  14.0
1      1  3   3   3.0   3.0
2      2  5  54   NaN   NaN
3      4  1   1   NaN   NaN

In [ ]:
df3

   level_0  index  A   B     C     D
0        0      0  3   2  14.0  14.0
1        1      1  3   3   3.0   3.0
2        2      2  5  54   NaN   NaN
3        3      4  1   1   NaN   NaN